##### ETL Process

#####  APAN 5310 Group 13

# Setting Up Connection

In [2]:
import pandas as pd
import numpy as np
import random
import string
import re
from sqlalchemy import create_engine
import warnings
from pandas.core.common import SettingWithCopyWarning
warnings.simplefilter(action="ignore", category=SettingWithCopyWarning)

In [3]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/cdl_final_project'

In [4]:
# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

# Create 3NF Database Tables

In [6]:
# Pass the SQL statements that create all tables
stmt = """

    CREATE TABLE program (
        program_id		serial,
        program_name		varchar(50)	NOT NULL UNIQUE,
        PRIMARY KEY (program_id)
    );

    CREATE TABLE industry (
        industry_id		serial,		
        industry_name		varchar(50)	NOT NULL UNIQUE,
        PRIMARY KEY (industry_id)
    );

    CREATE TABLE student (
        student_id  		varchar(6),
        student_first_name 	varchar(30),
        student_last_name 	varchar(30),
        program_id		integer,
        graduation_year	integer,
        graduation_term	varchar(10),
        city			varchar(50),
        state			varchar(50),
        country			varchar(50),
        PRIMARY KEY (student_id),
        CHECK (graduation_term IN ('Fall', 'Spring', 'Summer')),
        FOREIGN KEY (program_id) REFERENCES program
     );

    CREATE TABLE advisor (
        advisor_id		varchar(6),
        advisor_first_name 	varchar(30)	NOT NULL,
        advisor_last_name	varchar(30)	NOT NULL,
        program_id		integer		NOT NULL,	
        PRIMARY KEY (advisor_id),
        FOREIGN KEY (program_id) REFERENCES program
    );

    CREATE TABLE appointment (
        student_id		varchar(6),
        advisor_id		varchar(6),
        appointment_date	date,
        appointment_type	varchar(50),
        PRIMARY KEY (student_id, advisor_id, appointment_date),
        FOREIGN KEY (student_id) REFERENCES student,
        FOREIGN KEY (advisor_id) REFERENCES advisor
    );


    CREATE TABLE alumni (
        alumni_id		varchar(6),
        alumni_first_name	varchar(30)	NOT NULL,
        alumni_last_name	varchar(30)	NOT NULL,
        program_id		integer		NOT NULL,
        industry_id		integer,
        PRIMARY KEY (alumni_id),
        FOREIGN KEY (program_id) REFERENCES program,
        FOREIGN KEY (industry_id) REFERENCES industry
    );

    CREATE TABLE mentorship (
        student_id 		varchar(6),
        alumni_id		varchar(6),
        mentorship_date	date,
        PRIMARY KEY (student_id, alumni_id, mentorship_date),
        FOREIGN KEY (student_id) REFERENCES student,
        FOREIGN KEY (alumni_id) REFERENCES alumni
    );

    CREATE TABLE skill (
        skill_id			serial,
        skill_name		varchar(100)	NOT NULL UNIQUE,
        PRIMARY KEY (skill_id)	
    );	

    CREATE TABLE student_skill (
        student_id		varchar(6),		
        skill_id			integer,
        PRIMARY KEY (student_id, skill_id),
        FOREIGN KEY (student_id) REFERENCES student,		
        FOREIGN KEY (skill_id) REFERENCES skill
    );

    CREATE TABLE alumni_skill (
        alumni_id		varchar(6),
        skill_id			integer,
        PRIMARY KEY (alumni_id, skill_id),
        FOREIGN KEY (alumni_id) REFERENCES alumni,
        FOREIGN KEY (skill_id) REFERENCES skill
    );

    CREATE TABLE student_phone (
        student_phone_id		serial,
        phone_num		varchar(12) 	NOT NULL UNIQUE,
        phone_type		varchar(10)	NOT NULL,		
        student_id		varchar(6) 	NOT NULL,
        PRIMARY KEY (student_phone_id),
        FOREIGN KEY (student_id) REFERENCES student (student_id),
        CHECK (phone_type IN ('land', 'cell'))
    );

        CREATE TABLE alumni_phone (
        alumni_phone_id		serial,
        phone_num		varchar(12) 	NOT NULL UNIQUE,
        phone_type		varchar(10)	NOT NULL,		
        alumni_id		varchar(6) 	NOT NULL,
        PRIMARY KEY (alumni_phone_id),
        FOREIGN KEY (alumni_id) REFERENCES alumni (alumni_id),
        CHECK (phone_type IN ('land', 'cell'))
    );

        CREATE TABLE advisor_phone (
        advisor_phone_id		serial,
        phone_num		varchar(12) 	NOT NULL UNIQUE,
        phone_type		varchar(10)	NOT NULL,		
        advisor_id		varchar(6) 	NOT NULL,
        PRIMARY KEY (advisor_phone_id),
        FOREIGN KEY (advisor_id) REFERENCES advisor (advisor_id),
        CHECK (phone_type IN ('land', 'cell'))
    );


    CREATE TABLE career_event (
      event_id 		    serial, 
      event_name 		varchar(200)	NOT NULL,
      start_date 		date 		    NOT NULL,
      start_time 		time 		    NOT NULL,
      event_type 		varchar(100),
      location 		    varchar(200),
      registration_begins_on    date,
      registration_ends_on 	    date,
      host_name 		varchar(100),
      description 		text,
      PRIMARY KEY (event_id)
    ); 

    CREATE TABLE registration(
       event_id 		integer,
       student_id 		varchar(6) 	NOT NULL,
       PRIMARY KEY (event_id, student_id),
       FOREIGN KEY (event_id) REFERENCES career_event,
       FOREIGN KEY (student_id) REFERENCES student
    );

    CREATE TABLE career_outcome (
       record_id 		serial, 
       student_id 		varchar(6) 	NOT NULL,
       job_type 		varchar(80),
       industry_id 		integer 		NOT NULL,
       work_city 		varchar(50),
       work_country 		varchar(50),
       PRIMARY KEY (record_id),
       FOREIGN KEY (student_id) REFERENCES student,
       FOREIGN KEY (industry_id) REFERENCES industry
    );

    CREATE TABLE company (
       company_id 		serial 	        NOT NULL,
       company_name 	varchar(50) 	NOT NULL,
       year_founded		integer,
       city			    varchar(50),
       state			varchar(50),
       country		    varchar(50),
       zip_code		    varchar(10), 	
       company_type 	varchar(20),
       industry_id 		integer 		NOT NULL,
       web_url		    text,
       size 			varchar(50),
       description      text,
       PRIMARY KEY (company_id),
       FOREIGN KEY (industry_id) REFERENCES industry 
    );

    CREATE TABLE job_list (
       job_id 		serial 	NOT NULL,
       position  		varchar(100),
       description 		text,
       city 			varchar(50),
       company_id		integer,
       PRIMARY KEY (job_id),
       FOREIGN KEY (company_id) REFERENCES company
    );

    CREATE TABLE subject (
        subject_id		serial,
        subject_name		varchar(50)  	NOT NULL,
        PRIMARY KEY (subject_id)
    );

    CREATE TABLE online_course (
       course_id 		char(8) 		NOT NULL,
       course_title 	varchar(200)	NOT NULL,
       subject_id		integer		    NOT NULL,
       platform 		varchar(20),
       level 			varchar(20),
       price 			numeric(8,1),
       rating 		    numeric(2,1),
       course_description 	text,
       url 			        text,
       course_length 	varchar(50),
       n_enrolled 		integer,
       industry_id  		integer		NOT NULL,
       PRIMARY KEY (course_id),
       FOREIGN KEY (industry_id) REFERENCES industry,
       FOREIGN KEY (subject_id) REFERENCES subject,
       CHECK (level IN ('Introductory', 'Intermediate', 'Advanced'))
    );


    CREATE TABLE instructor (
        instructor_id		    serial,
        instructor_first_name	varchar(60),
        instructor_last_name	varchar(60),
        institution_name	varchar(200),
        PRIMARY KEY (instructor_id)
    );

    CREATE TABLE course_teaching (
        course_id		char(8)		NOT NULL,
        instructor_id 		integer		NOT NULL,
        PRIMARY KEY (course_id, instructor_id),
        FOREIGN KEY (course_id) REFERENCES online_course,
        FOREIGN KEY (instructor_id) REFERENCES instructor
    );


    CREATE TABLE news (
        news_id 		serial,
        news_title 		varchar(300)	NOT NULL,
        industry_id		integer,
        news_category		varchar(30)        NOT NULL,
        news_content		text,	
        PRIMARY KEY (news_id),
        FOREIGN KEY(industry_id) REFERENCES industry
    );
"""

# Execute the statement to create tables
connection.execute(stmt)

## Courses

In [7]:
courses = pd.read_csv('courses.csv')

In [8]:
len(courses)

975

### Create 'subject' Table

Select the 'subject' column from courses dataframe, in order to remove the duplicates. Insert an unique id (subject_id) for each subject.

In [9]:
# Create dataframe with unique subjects
Subject = pd.DataFrame(courses.subject.unique(), columns=['subject_name'])

# Add incrementing integers for subject_id
Subject.insert(0, 'subject_id', range(1, 1 + len(Subject)))

len(Subject)

31

In [10]:
# Final Subject Table
Subject.head()

   subject_id                  subject_name
0           1  Education & Teacher Training
1           2              Computer Science
2           3    Data Analysis & Statistics
3           4         Business & Management
4           5                 Communication

In [11]:
# Join subject_id back to courses dataframe
courses = courses.merge(Subject, how='left', left_on=['subject'], right_on=['subject_name'])

### Create 'instructor' Table

In [12]:
# Split instructors and expand row-wise. Store in a temporary dataframe
instructors_name = courses.instructors.str.split('-').apply(pd.Series, 1).stack()

# Remove instructors' title
instructors_name = instructors_name.str.replace('Dr ', '')

# Drop index level to match main dataframe
instructors_name.index = instructors_name.index.droplevel(-1)

# Name of new column
instructors_name.name = 'instructors_name'

# Delete the original instructors columns, no longer necessary
del courses['instructors']

# Join the original dataframe with the temporary instructors_name
courses = courses.join(instructors_name)

# Split instructor name to first name and last name
courses[['instructor_first_name','instructor_last_name']] = courses['instructors_name'].str.split(" ",1,expand=True)

In [13]:
# Create instructors table and keep unique values
instructors = courses[['instructor_first_name','instructor_last_name','institution']].drop_duplicates()

# Add incrementing integers for instructor_id
instructors.insert(0, 'instructor_id', range(1, 1 + len(instructors)))

# Rename column name
instructors.rename(columns = {'institution': 'institution_name'}, inplace = True)

In [14]:
# Final instructors table
instructors.head()

,instructor_id,instructor_first_name,instructor_last_name,institution_name
0,1,Nina,Huntemann,edX
0,2,Robyn,Belair,edX
0,3,Ben,Piscopo,edX
1,4,Charles,Severance,The University of Michigan
2,5,David,J. Malan,Harvard University

In [15]:
# Join instructor_id back to courses table
courses = courses.merge(instructors, how='left', 
                        left_on=['instructor_first_name','instructor_last_name','institution'], 
                        right_on=['instructor_first_name','instructor_last_name','institution_name'])

### Create 'industry' Table (step1)

Split duplicated industry to a separate table.

In [16]:
# Create dataframe with unique industry
industry = courses[['industry']].drop_duplicates()

# Add incrementing integers for subject_id
industry.insert(0, 'industry_id', range(1, 1 + len(industry)))
industry = industry.reset_index(drop=True)

len(industry)

12

In [17]:
# Final industry table
industry.head()

   industry_id                    industry
0            1                   Education
1            2             Data/Technology
2            3   Business & Legal Services
3            4                  Healthcare
4            5        Lifestyle & Consumer

In [18]:
# Join industry_id back to courses table
courses = courses.merge(industry, how='left', on=['industry'])

### Create 'online_course' Table

Create a table for each unique online course.

In [19]:
# Extract price amount from price column
courses['price_amount'] = courses.price.str.findall('(\d+)').apply(''.join).astype(float).apply("{:.02f}".format)

# Create online_course table and keep unique values
online_course = courses[['title','subject_id','platform','Level','price_amount','rating','course_description',
                        'course_url','course_length','n_enrolled','industry_id']].drop_duplicates()

# Random 8 characters for course_id
random.seed(10)
course_id = pd.Series([''.join(random.choices(string.ascii_uppercase, k=8)) for _ in range(3000)])
online_course.insert(0, 'course_id', course_id)

online_course = online_course.reset_index(drop=True)

In [20]:
# Join course_id back to courses table
courses = courses.merge(online_course, how='left', on=['title','subject_id','platform','Level','price_amount',
                                                        'rating','course_description','course_url','course_length',
                                                        'n_enrolled','industry_id'])

In [21]:
# Rename column names
online_course.rename(columns = {'title': 'course_title',
                                'price_amount': 'price',
                                'Level': 'level',
                                'course_url': 'url'}, inplace = True)

# Change data types
online_course['n_enrolled'] = pd.to_numeric(online_course['n_enrolled'].dropna().map(lambda x: re.sub(',', '', str(x)))).astype(float).astype('Int64')
online_course['price'] = pd.to_numeric(online_course.price).astype(float)
online_course['price'] = round(online_course['price'], 2)

# Final online_course table
online_course.head()

,course_id,course_title,subject_id,platform,level,price,rating,course_description,url,course_length,n_enrolled,industry_id
0,OLPFVVQE,How to Learn Online,1,edX,Introductory,49.0,4.6,"Designed for those who are new to elearning, t...",https://www.edx.org/course/how-to-learn-online,2 Weeks,124980,1
1,ZZPBADYH,Programming for Everybody (Getting Started wit...,2,edX,Introductory,49.0,4.9,This course aims to teach everyone the basics ...,https://www.edx.org/course/programming-for-eve...,7 Weeks,293864,2
2,JXIOLBPV,CS50's Introduction to Computer Science,2,edX,Introductory,90.0,4.1,"This is CS50x , Harvard University's introduct...",https://www.edx.org/course/cs50s-introduction-...,12 Weeks,2442271,2
3,EUYLKGHQ,The Analytics Edge,3,edX,Intermediate,199.0,4.9,"In the last decade, the amount of data availab...",https://www.edx.org/course/the-analytics-edge,13 Weeks,129555,2
4,PBMLKKPO,Marketing Analytics: Marketing Measurement Str...,2,edX,Introductory,249.0,4.9,Begin your journey in a new career in marketin...,https://www.edx.org/course/marketing-analytics...,4 Weeks,81140,2

### Create 'course_teaching' Table 

We have many-to-many relationship between instructors and courses.

In [22]:
course_teaching = courses[['course_id','instructor_id']].drop_duplicates()
course_teaching.head(10)

  course_id  instructor_id
0  OLPFVVQE              1
1  OLPFVVQE              2
2  OLPFVVQE              3
3  ZZPBADYH              4
4  JXIOLBPV              5
5  JXIOLBPV              6
6  JXIOLBPV              7
7  EUYLKGHQ              8
8  EUYLKGHQ              9
9  EUYLKGHQ             10

## News

In [23]:
news = pd.read_csv('news.csv')

In [24]:
len(news)

6872

### Create 'insdustry' Table (step2)

In [25]:
# Create dataframe with unique industry
news_industry = news[['industry']].drop_duplicates()

# Concat news_industry with the industry table (only concat the ones not in the table)
industry = pd.concat([industry, news_industry[~np.in1d(news_industry['industry'], industry['industry'])]], 
                     ignore_index=True)

# Set industry_id
industry['industry_id'] = range(1, 1 + len(industry))

In [26]:
# Final industry table
industry

    industry_id                    industry
0             1                   Education
1             2             Data/Technology
2             3   Business & Legal Services
3             4                  Healthcare
4             5        Lifestyle & Consumer
5             6        Finance & Investment
6             7          Food & Agriculture
7             8       Research & Consulting
8             9          Geospatial/Mapping
9            10       Environment & Weather
10           11         Scientific Research
11           12                      Energy
12           13   Business & Legal Services
13           14                       Media

### Create 'news' Table

In [27]:
# Join industry_id back to news table
news = news.merge(industry, how='left', on=['industry'])

# Delete unnecessary column 'industry'
del news['industry']

# Add incrementing integers for news_id
news.insert(0, 'news_id', range(1, 1 + len(news)))


# Rename column names
news.rename(columns={'title':'news_title',
                     'category':'news_category',
                     'body':'news_content'}, inplace = True)
# Reorder the table columns
news = news[['news_id','news_title','industry_id','news_category','news_content']]

# Final news table
news.head()

,news_id,news_title,industry_id,news_category,news_content
0,1,Modeling Agencies Enabled Sexual Predators For...,5,Arts & culture,"In October 2017, Carolyn Kramer received a dis..."
1,2,Actor Jeff Hiller Talks “Bright Colors And Bol...,5,Arts & culture,This week I talked with actor Jeff Hiller abou...
2,3,New Yorker Cover Puts Trump 'In The Hole' Afte...,5,Arts & culture,The New Yorker is taking on President Donald T...
3,4,Man Surprises Girlfriend By Drawing Them In Di...,5,Arts & culture,"Kellen Hickey, a 26-year-old who lives in Huds..."
4,5,This Artist Gives Renaissance-Style Sculptures...,5,Arts & culture,There’s something about combining the traditio...

## Job Lists

In [28]:
job_lists = pd.read_csv('job_list.csv')

In [29]:
job_lists.head()

,Job Title,Employer,Job Description,Type of Job,City,company_name_id,url,year_founded,city,state,...,business_model,social_impact,description,description_short,source_count,data_types,example_uses,data_impacts,financial_info,last_updated
0,"Director, Pixel Strategy, Business Operations,...",google,Job detailsJob TypeFull-timeFull Job Descripti...,Job,SF,google,https://goo.gle/3m1IN7m,1998.0,Mountain View,CA,...,"Business to Business, Business to Consumer",NaN,A problem isn't truly solved until it's solved...,NaN,NaN,NaN,NaN,NaN,NaN,9/11/2014 17:23:21
1,"Director, Engineering, Search Analytics Data W...",google,Job detailsJob TypeFull-timeFull Job Descripti...,Job,SF,google,https://goo.gle/3m1IN7m,1998.0,Mountain View,CA,...,"Business to Business, Business to Consumer",NaN,A problem isn't truly solved until it's solved...,NaN,NaN,NaN,NaN,NaN,NaN,9/11/2014 17:23:21
2,"Director, Operational Excellence, Strategy and...",google,Job detailsJob TypeFull-timeFull Job Descripti...,Job,SF,google,https://goo.gle/3m1IN7m,1998.0,Mountain View,CA,...,"Business to Business, Business to Consumer",NaN,A problem isn't truly solved until it's solved...,NaN,NaN,NaN,NaN,NaN,NaN,9/11/2014 17:23:21
3,"Director, Business Operations and Strategy",google,Job detailsJob TypeFull-timeFull Job Descripti...,Job,SF,google,https://goo.gle/3m1IN7m,1998.0,Mountain View,CA,...,"Business to Business, Business to Consumer",NaN,A problem isn't truly solved until it's solved...,NaN,NaN,NaN,NaN,NaN,NaN,9/11/2014 17:23:21
4,"Director, Product Management, Document AI",google,Job detailsJob TypeFull-timeFull Job Descripti...,Job,SF,google,https://goo.gle/3m1IN7m,1998.0,Mountain View,CA,...,"Business to Business, Business to Consumer",NaN,A problem isn't truly solved until it's solved...,NaN,NaN,NaN,NaN,NaN,NaN,9/11/2014 17:23:21

### Create 'company' Table

First create the company table. Since the dataset has repeating employer names for different position opened, we will create a temporary dataframe with the unique employer only, add a column of incrementing integer numbers as employer_id and then map these numbers back to the main dataframe, job_list.

In [30]:
# Create temporary dataframe with unique Employer names
temp_employer_df = job_lists[['Employer','year_founded','city','state','country','zip_code','company_type','company_category','url','full_time_employees','description']].drop_duplicates()
# Add incrementing integers as Employer_id(PK)
temp_employer_df.insert(0, 'Employer_id', range(1000, 1000 + len(temp_employer_df)))
# Rename column name
temp_employer_df.rename(columns={'company_category':'industry'}, inplace=True)
temp_employer_df.head()

,Employer_id,Employer,year_founded,city,state,country,zip_code,company_type,industry,url,full_time_employees,description
0,1000,google,1998.0,Mountain View,CA,us,94039.0,Public,Technology,https://goo.gle/3m1IN7m,"10,001+",A problem isn't truly solved until it's solved...
7,1001,doordash,2013.0,San Francisco,CA,us,94103.0,Public,Software Development,https://careers.doordash.com/,"10,001+","At DoorDash, our mission to empower local econ..."
10,1002,uber,2009.0,San Francisco,CA,us,94105.0,Private,Transportation,https://www.uber.com/,"1,001-5,000",Uber aims to evolve the way the world moves: b...
12,1003,l'oreal,1909.0,New York,NY,us,10001.0,Public,Personal Care Product Manufacturing,http://www.loreal.com,"10,001+",Leading the world in beauty and pioneering the...
14,1004,factset,1978.0,Norwalk,CT,us,6851.0,Public,Finance & Investment,http://www.factset.com,"5,001-10,000",FactSet Research Systems provides multinationa...

### Create 'industry' Table (step3)

In [31]:
# Create dataframe with unique industry of companies
company_industry = temp_employer_df[['industry']].drop_duplicates()

# Concat news_industry with the industry table (only concat the ones not in the table)
industry = pd.concat([industry, company_industry[~np.in1d(company_industry['industry'], industry['industry'])]], 
                     ignore_index=True)

# Set industry_id
industry['industry_id'] = range(1, 1 + len(industry))

In [32]:
# industry table with company's industry
industry

    industry_id                             industry
0             1                            Education
1             2                      Data/Technology
2             3            Business & Legal Services
3             4                           Healthcare
4             5                 Lifestyle & Consumer
5             6                 Finance & Investment
6             7                   Food & Agriculture
7             8                Research & Consulting
8             9                   Geospatial/Mapping
9            10                Environment & Weather
10           11                  Scientific Research
11           12                               Energy
12           13            Business & Legal Services
13           14                                Media
14           15                           Technology
15           16                 Software Development
16           17                       Transportation
17           18  Personal Care Product Manufacturing
18           19                            Musicians
19           20                    Finacial Services

In [33]:
# Join industry_id back to company table
temp_employer_df = temp_employer_df.merge(industry, how='left', on=['industry'])

# Delete unnecessary column 'industry'
del temp_employer_df['industry']

In [34]:
temp_employer_df.rename(columns={'Employer_id':'company_id', 
                                'Employer':'company_name',
                                'url':'web_url',
                                'full_time_employees':'size'}, inplace=True)
# Reorder the columns
temp_employer_df=temp_employer_df[['company_id','company_name','year_founded','city','state','country','zip_code',
                  'company_type','industry_id','web_url','size','description']]

# Final company table
temp_employer_df.head()

,company_id,company_name,year_founded,city,state,country,zip_code,company_type,industry_id,web_url,size,description
0,1000,google,1998.0,Mountain View,CA,us,94039.0,Public,15,https://goo.gle/3m1IN7m,"10,001+",A problem isn't truly solved until it's solved...
1,1001,doordash,2013.0,San Francisco,CA,us,94103.0,Public,16,https://careers.doordash.com/,"10,001+","At DoorDash, our mission to empower local econ..."
2,1002,uber,2009.0,San Francisco,CA,us,94105.0,Private,17,https://www.uber.com/,"1,001-5,000",Uber aims to evolve the way the world moves: b...
3,1003,l'oreal,1909.0,New York,NY,us,10001.0,Public,18,http://www.loreal.com,"10,001+",Leading the world in beauty and pioneering the...
4,1004,factset,1978.0,Norwalk,CT,us,6851.0,Public,6,http://www.factset.com,"5,001-10,000",FactSet Research Systems provides multinationa...

Adding a new column Employer_id to the main dataframe, df, as the primay key. \
Using temp_employer_df to create a list mapping Employer_id with each employer in df and then inserting this list to df as a new column.

In [35]:
# Map company_id
employer_id_list = [temp_employer_df.company_id[temp_employer_df.company_name == i].values[0] for i in job_lists.Employer]

# Add company_id to the main dataframe
job_lists.insert(0, 'company_id', employer_id_list)

In [36]:
# Check whether the repeating employers have the same employer id
job_lists[['company_id', 'Employer']][job_lists.Employer.isin(['google', 'doordash'])]

   company_id  Employer
0        1000    google
1        1000    google
2        1000    google
3        1000    google
4        1000    google
5        1000    google
6        1000    google
7        1001  doordash
8        1001  doordash
9        1001  doordash

### Create 'job_list' Table

In [37]:
# Since all the job lists are unique in the dataset, even when the position is the same, location is different. So we no longer need to
# worry about duplicates. Now creating a new column with incrementing integer numbers for job_id, and each job_id is unique for each job list
job_lists.insert(1, 'job_id', range(1, 1 + len(job_lists)))

In [38]:
# Create a subset of df corresponding to the job list database table.
job_list_df = job_lists[['job_id', 'Job Title', 'description', 'city', 'company_id']]

# Rename column names
job_list_df.rename(columns={'Job Title':'position'}, inplace=True)

# Final Job_List Table
job_list_df.head()

,job_id,position,description,city,company_id
0,1,"Director, Pixel Strategy, Business Operations,...",A problem isn't truly solved until it's solved...,Mountain View,1000
1,2,"Director, Engineering, Search Analytics Data W...",A problem isn't truly solved until it's solved...,Mountain View,1000
2,3,"Director, Operational Excellence, Strategy and...",A problem isn't truly solved until it's solved...,Mountain View,1000
3,4,"Director, Business Operations and Strategy",A problem isn't truly solved until it's solved...,Mountain View,1000
4,5,"Director, Product Management, Document AI",A problem isn't truly solved until it's solved...,Mountain View,1000

In [39]:
# Create a subset of df corresponding to the job list database table.
job_list_df = job_lists[['job_id', 'Job Title', 'description', 'city', 'company_id']]

# Rename column names
job_list_df.rename(columns={'Job Title':'position'}, inplace=True)

## CDL Career Outcome

In [40]:
# Load the dataset 'Student_CDL_Career_Outcome.csv'
outcome=pd.read_csv('cdl_career_outcome.csv')

# Convert column names into lowercase 
outcome=outcome.rename(columns=str.lower)

outcome.head()

,student_id,last_name,first_name,city,state,country,program,graduation term,graduation year,phone_no_cell,phone_no_land,skill_1,skill_2,work_city,work_country,job_type,industry
0,tw3253,Woolerton,Tessy,Minneapolis,Minnesota,United States,Sustainability Science,Summer,2021,600-639-5191,321-969-8472,Product Knowledge,NaN,Auburn Hills - MI,United States (USA),Postponing job search,Data/Technology
1,ae4257,Edgcombe,Adriaens,Boise,Idaho,United States,Nonprofit Management,Fall,2021,754-790-0611,NaN,Creativity,NaN,Chennai - India,India,Still Seeking Employment,Scientific Research
2,pg3091,Girardi,Phaedra,Scranton,Pennsylvania,United States,Nonprofit Management,Spring,2016,332-195-5165,NaN,Scheduling,NaN,Old Westbury - NY,United States (USA),Military Service,Governance
3,rt6370,Tolputt,Ruperto,Newport Beach,California,United States,Narrative Medicine,Summer,2016,482-623-1659,297-942-0505,Organization,NaN,San Mateo - CA,United States (USA),Internship,Healthcare
4,aj7909,Jansey,Aridatha,Decatur,Georgia,United States,Sustainability Science,Spring,2022,828-523-0350,764-272-3322,Contract Negotiation,NaN,Philadelphia - PA,United States (USA),Not seeking an internship,Data/Technology

### Create 'student' Table (step1)

In [41]:
# Drop duplicates records
student = outcome[['student_id','first_name','last_name','program','graduation year','graduation term','city','state','country']].drop_duplicates()
len(student)

733

### Create 'program' Table

In [42]:
# Create program database:
# Get program info from student table and drop duplicates
program = student[['program']].drop_duplicates()

# Add program_id into the program table
program.insert(0, 'program_id', range(1, 1 + len(program)))
program = program.reset_index(drop=True)

# Final program table
program

    program_id                              program
0            1               Sustainability Science
1            2                 Nonprofit Management
2            3                   Narrative Medicine
3            4              Strategic Communication
4            5  Negotiation and Conflict Resolution
5            6                    Wealth Management
6            7                    Sports Management
7            8          Construction Administration
8            9             Human Capital Management
9           10            Sustainability Management
10          11           Enterprise Risk Management
11          12                    Actuarial Science
12          13                    Applied Analytics
13          14                            Bioethics
14          15       Information Knowledge Strategy
15          16                Technology Management
16          17                 Insurance Management

In [43]:
# Join program_id back to student table
student = student.merge(program, how='left', on=['program'])

# Delete unnecessary column 'program'
del student['program']

# Rename column names
student.rename(columns={'first_name':'student_first_name',
                        'last_name':'student_last_name',
                        'graduation year':'graduation_year',
                        'graduation term':'graduation_term'}, inplace=True)

# Reorder the columns
cols = list(student.columns)
cols = cols[0:3]+[cols[-1]]+cols[3:8]
student = student[cols]

# Final student table
student.head()

,student_id,student_first_name,student_last_name,program_id,graduation_year,graduation_term,city,state,country
0,tw3253,Tessy,Woolerton,1,2021,Summer,Minneapolis,Minnesota,United States
1,ae4257,Adriaens,Edgcombe,2,2021,Fall,Boise,Idaho,United States
2,pg3091,Phaedra,Girardi,2,2016,Spring,Scranton,Pennsylvania,United States
3,rt6370,Ruperto,Tolputt,3,2016,Summer,Newport Beach,California,United States
4,aj7909,Aridatha,Jansey,1,2022,Spring,Decatur,Georgia,United States

### Create 'industry' Table (step4)

In [44]:
# Create dataframe with unique industry of companies
outcome_industry = outcome[['industry']].drop_duplicates()
outcome_industry
# Concat news_industry with the industry table, and only concat the ones not in the table.
industry = pd.concat([industry, outcome_industry[~np.in1d(outcome_industry['industry'], industry['industry'])]], 
                     ignore_index=True)
industry = industry[~industry['industry'].isna()]

# Set industry_id
industry['industry_id'] = range(1, 1 + len(industry))

# industry table with student outcome
industry

    industry_id                             industry
0             1                            Education
1             2                      Data/Technology
2             3            Business & Legal Services
3             4                           Healthcare
4             5                 Lifestyle & Consumer
5             6                 Finance & Investment
6             7                   Food & Agriculture
7             8                Research & Consulting
8             9                   Geospatial/Mapping
9            10                Environment & Weather
10           11                  Scientific Research
11           12                               Energy
12           13            Business & Legal Services
13           14                                Media
14           15                           Technology
15           16                 Software Development
16           17                       Transportation
17           18  Personal Care Product Manufacturing
18           19                            Musicians
19           20                    Finacial Services
20           21                           Governance
21           22                            Insurance
22           23                Aerospace and Defense
23           24                  Housing/Real Estate

### Create 'career_outcome' Table

In [45]:
# Join industry_id back to news table
outcome = outcome.merge(industry, how='left', on=['industry'])

# Delete unnecessary column 'industry'
del outcome['industry']

# Drop duplicates records
career_outcome = outcome[['student_id','job_type','industry_id','work_city','work_country']].drop_duplicates()

# Add incrementing integers for record_id
career_outcome.insert(0, 'record_id', range(1, 1 + len(career_outcome)))

# Final career_outcome table
career_outcome.head()

,record_id,student_id,job_type,industry_id,work_city,work_country
0,1,tw3253,Postponing job search,2,Auburn Hills - MI,United States (USA)
1,2,ae4257,Still Seeking Employment,11,Chennai - India,India
2,3,pg3091,Military Service,21,Old Westbury - NY,United States (USA)
3,4,rt6370,Internship,4,San Mateo - CA,United States (USA)
4,5,aj7909,Not seeking an internship,2,Philadelphia - PA,United States (USA)

## CDL Events

In [46]:
# Load the dataset 'cdl_events.csv'
event=pd.read_csv('cdl_events.csv')

# Convert column names into lowercase 
event=event.rename(columns=str.lower)

# rename column names
event.columns=['event_name','start_date_period','event_type','location','start_date_time','registration_begins_on',
               'registration_ends_on','description','host_name','student_id']

### Create 'career_event' Table

In [47]:
# Split start_date_time into start_date & start_time 
event[['start_date','start_time']] = event['start_date_time'].str.split(",",1,expand=True)

# Split student_id and expand row-wise. Store in a temporary dataframe
temp_df = event.student_id.str.split(' ').apply(pd.Series, 1).stack()

# Drop index level to match main dataframe
temp_df.index = temp_df.index.droplevel(-1)

# Name of new column
temp_df.name = 'student_id'

# Delete the original student_id columns, no longer necessary
del event['student_id']

# Join the original dataframe with the temporary_df 
event = event.join(temp_df)

# Remove special characters from student_id columns
event['student_id']=event['student_id'].str.replace("['^\([.*\])?']",'', regex=True)
event['student_id']=event['student_id'].str.replace("[\n]",'', regex=True)

In [48]:
# Select and drop duplicates records
career_event = event[['event_name','start_date','start_time','event_type','location','registration_begins_on',
                        'registration_ends_on','host_name','description']].drop_duplicates()

# Add incrementing numbers to the created column 'event_id'
career_event.insert(0, 'event_id', range(1, 1 + len(career_event)))

# Final Career_Event Table
career_event.head(10)

,event_id,event_name,start_date,start_time,event_type,location,registration_begins_on,registration_ends_on,host_name,description
0,1,HBCU Group Coaching Session II - Summer Intern...,07/12/2022,12:00PM EDT,Professional Development Workshop & Program,Virtual,"07/05/2022, 12:00PM EDT","07/12/2022, 11:45AM EDT",Career Design Lab,Your pitch is one of the most important compon...
1,2,Salary Negotiation,07/07/2022,10:30AM EDT,Professional Development Workshop & Program,Virtual,"05/24/2022, 12:15PM EDT","07/07/2022, 10:30AM EDT",Career Design Lab,Salary negotiation is an important way to incr...
2,3,Rebranding Yourself,06/28/2022,12:00PM EDT,Professional Development Workshop & Program,Virtual,"05/24/2022, 12:00PM EDT","06/28/2022, 12:00PM EDT",Career Design Lab,If you want to take your career to the next le...
3,4,How to Prepare for Interviewing and Networking,06/21/2022,11:00AM EDT,Professional Development Workshop & Program,Virtual,"05/24/2022, 12:00PM EDT","06/21/2022, 11:00AM EDT",Career Design Lab,Do you have an upcoming interview?Unsure how t...
4,5,Pride at Work: Championing LGBTQIA+ Leaders & ...,06/20/2022,10:00AM EDT,External Event,Virtual,NaN,NaN,NaN,JOIN US VIRTUALLY JUNE 20 - 23DIVERSITY REBOOT...
5,6,Networking with Wealth Management Professional...,06/15/2022,5:00PM EDT,Employer Panel,Virtual,"05/18/2022, 12:00PM EDT","06/15/2022, 9:00AM EDT",Career Design Lab,Columbia University's Career Design LabÂ host...
6,7,Resume Review,06/09/2022,12:30PM EDT,Professional Development Workshop & Program,Virtual,"05/24/2022, 12:00PM EDT","06/09/2022, 12:30PM EDT",Career Design Lab,Are you updating your resume this summer?Custo...
7,8,Join the Wildfire Resilience Case Competition!,06/01/2022,11:40PM EDT,External Event,Virtual,NaN,NaN,Net Impact,Join the Wildfire ResilienceCase Competition!N...
8,9,NBCU Universal - Fall 2022 Internship Program ...,06/01/2022,3:00PM EDT,External Event,Instagram Live (@nbcu_interns),NaN,NaN,"NBCUniversal Media, LLC",Hello from NBCUniversal!Â Â We have launched o...
9,10,McKinsey Sector Spotlight â Life Sciences,05/26/2022,6:00PM EDT,External Event,Virtual,"04/01/2022, 11:00AM EDT","04/26/2022, 12:00PM EDT",McKinsey & Company,Event descriptionThis session is open to Advan...

### Create 'registration' Table

In [49]:
# Join event_id back to the outcome table
event = event.merge(career_event, how='left', on=['event_name','start_date','start_time','event_type','location','registration_begins_on',
                        'registration_ends_on','host_name','description'])

# Create df of registration with corresponding columns
registration = event[['event_id','student_id']].drop_duplicates()

# Final registration Table
registration.head(10)

   event_id student_id
0         1     eh8783
1         1     dv9880
2         1     wm9692
3         1     ah8215
4         1     ek2278
5         1     md1350
6         1     bw9557
7         1     tm7389
8         1     bj1369
9         1     pd4505

##### Cancat student_id, names into student table

In [50]:
# Create temporary table for students from appointment
event_student = registration[['student_id']].drop_duplicates()

# Concat app_student with the industry table, and only concat the ones not in the table.
student = pd.concat([student, event_student[~np.in1d(event_student['student_id'], student['student_id'])]], 
                     ignore_index=True)

## CDL Appointments

In [51]:
appointment = pd.read_csv('cdl_appointments.csv')
appointment.head()

,appointment_date,appointment_type,student_id,student_firstname,student_lastname,adv_id,adv_lastname,adv_firstname,adv_program,adv_phone_no_cell,adv_phone_no_land
0,2016-03-10,Networking Strategy,ef2973,Elbert,Frede,kt7376,Thatcher,Kieth,Information Knowledge Strategy,673-620-5613,NaN
1,2015-12-10,Salary Negotiation,lc9120,Lula,Chasmor,jr5803,Reid,John,Applied Analytics,785-885-8857,507-874-5721
2,2021-05-25,Resume Review,gb4123,Gerick,Baford,ba3545,Allen,Bryce,Enterprise Risk Management,953-597-8601,NaN
3,2018-09-12,Salary Negotiation,ac4719,Adora,Cassar,cj1862,Jackson,Carissa,Nonprofit Management,547-863-5667,189-630-4794
4,2018-09-12,Self-Assessment,aw4977,Addy,Whyard,ly7056,Yarwood,Logan,Negotiation and Conflict Resolution,634-912-5228,808-199-8505

### Create 'advisor' Table

In [52]:
# Create advisor info database:
# Create a subset of appointment table corresponding to the advisor table and drop duplicates
advisor = appointment[['adv_id', 'adv_firstname', 'adv_lastname', 'adv_program', 'adv_phone_no_cell', 
                       'adv_phone_no_land']].drop_duplicates()
# Merge program_id with the previous advisor table
advisor1 = pd.merge(advisor, program, how='left', left_on='adv_program', right_on='program')
advisor1 = advisor1[['adv_id', 'adv_firstname', 'adv_lastname', 'program_id', 'adv_phone_no_cell', 'adv_phone_no_land']]

In [53]:
# Create 3NF advisor database, remove the phone numbers:
advisor_nf = advisor1[['adv_id', 'adv_firstname', 'adv_lastname', 'program_id']]

# Rename column names
advisor_nf.columns = ['advisor_id','advisor_first_name','advisor_last_name','program_id']

# Final advisor table
advisor_nf.head()

  advisor_id advisor_first_name advisor_last_name  program_id
0     kt7376              Kieth          Thatcher          15
1     jr5803               John              Reid          13
2     ba3545              Bryce             Allen          11
3     cj1862            Carissa           Jackson           2
4     ly7056              Logan           Yarwood           5

### Create 'student' Table (step2)
##### Cancat student_id, names into student table

In [54]:
# Create temporary table for students from appointment
app_student = appointment[['student_id','student_firstname','student_lastname']].drop_duplicates()
# Rename column names
app_student.columns=['student_id','student_first_name','student_last_name']

# Concat app_student with the industry table, and only concat the ones not in the table.
student = pd.concat([student, app_student[~np.in1d(app_student['student_id'], student['student_id'])]], 
                     ignore_index=True)

### Create 'appointment' Table

In [55]:
# Create appointment database:
appointment1 = appointment[['student_id', 'adv_id', 'appointment_date', 'appointment_type']]
# Rename column names
appointment1.columns = ['student_id','advisor_id','appointment_date','appointment_type']
# Final appointment table
appointment1

    student_id advisor_id appointment_date                   appointment_type
0       ef2973     kt7376       2016-03-10                Networking Strategy
1       lc9120     jr5803       2015-12-10                 Salary Negotiation
2       gb4123     ba3545       2021-05-25                      Resume Review
3       ac4719     cj1862       2018-09-12                 Salary Negotiation
4       aw4977     ly7056       2018-09-12                    Self-Assessment
..         ...        ...              ...                                ...
195     ac2336     om4035       2021-09-13                 Salary Negotiation
196     sw3803     br7574       2019-06-11                 Salary Negotiation
197     tm7389     km5645       2019-11-08  Industry & Occupation Exploration
198     wd1262     br7574       2022-01-05         Personal Brand Development
199     ad2419     rf7197       2016-02-25                Networking Strategy

[200 rows x 4 columns]

## Mentorship

In [56]:
mentorship = pd.read_csv('cdl_mentorships.csv')
mentorship.head()

,mentorship_date,student_id,student_firstname,student_lastname,alumni_id,alumni_lastname,alumni_firstname,alumni_program,alumni_job_industry,alumni_phone_no_cell,alumni_phone_no_land,alumni_skill_1,alumni_skill_2
0,2017-01-02,hc3237,Hagan,Cable,nk7657,Kurt,Neal,Information Knowledge Strategy,Environment & Weather,905-951-5322,NaN,Scheduling,NaN
1,2016-11-29,sl4152,Sayer,Lissandre,cr8605,Rosie,Cunningham,Human Capital Management,Media,750-933-3580,141-652-9789,Negotiation,NaN
2,2019-04-22,gl4274,Gilberte,Leebeter,le5799,Elle,Long,Sustainability Management,Research & Consulting,713-952-0376,NaN,Office Equipment,NaN
3,2019-07-05,bs7868,Brier,Spinetti,eo6439,Oliver,Edwards,Sports Management,Media,643-753-4622,NaN,Negotiation,NaN
4,2017-04-27,ga2856,Goddard,Alcide,pl5399,Logan,Price,Applied Analytics,Finance & Investment,294-879-8447,874-429-3715,Welcoming Visitors,Java

### Create 'alumni' Table

In [57]:
# Create alumni info database:
# Create a subset of mentorship table corresponding to the alumni table and drop duplicates
alumni = mentorship[['alumni_id', 'alumni_firstname', 'alumni_lastname', 'alumni_program','alumni_job_industry',
                    'alumni_phone_no_cell', 'alumni_phone_no_land', 'alumni_skill_1', 'alumni_skill_2']].drop_duplicates()

# Merge program_id with the previous alumni table
alumni1 = pd.merge(alumni, program, how='left', left_on='alumni_program', right_on='program')
alumni1 = alumni1[['alumni_id', 'alumni_firstname', 'alumni_lastname', 'program_id','alumni_job_industry',
                  'alumni_phone_no_cell', 'alumni_phone_no_land', 'alumni_skill_1', 'alumni_skill_2']]
alumni1.head(10)

,alumni_id,alumni_firstname,alumni_lastname,program_id,alumni_job_industry,alumni_phone_no_cell,alumni_phone_no_land,alumni_skill_1,alumni_skill_2
0,nk7657,Neal,Kurt,15,Environment & Weather,905-951-5322,NaN,Scheduling,NaN
1,cr8605,Cunningham,Rosie,9,Media,750-933-3580,141-652-9789,Negotiation,NaN
2,le5799,Long,Elle,10,Research & Consulting,713-952-0376,NaN,Office Equipment,NaN
3,eo6439,Edwards,Oliver,7,Media,643-753-4622,NaN,Negotiation,NaN
4,pl5399,Price,Logan,13,Finance & Investment,294-879-8447,874-429-3715,Welcoming Visitors,Java
5,jr7218,Johnson,Rosalyn,10,Finance & Investment,765-767-4252,NaN,Lead Qualification,NaN
6,vh5628,Ventura,Harry,7,Governance,919-214-9720,911-105-5872,Negotiation,NaN
7,vt1529,Villiger,Teagan,9,Data/Technology,916-795-1144,533-746-4116,Communication,Machine Learning
8,hm7100,Harrington,Mary,11,Media,946-878-9892,NaN,Empathy,NaN
9,pe4593,Patel,Elise,8,Governance,240-849-6971,NaN,Accounting,NaN

### Create 'industry' Table (step5)
##### Concat alumni's job industry to the industry table

In [58]:
# Rename column name for industry
alumni1.rename(columns={'alumni_job_industry':'industry'}, inplace=True)

# Create dataframe with unique industry of alumni
alu_industry = alumni1[['industry']].drop_duplicates()
alu_industry

# Concat alu_industry with the industry table, and only concat the ones not in the table.
industry = pd.concat([industry, alu_industry[~np.in1d(alu_industry['industry'], industry['industry'])]], 
                     ignore_index=True)
industry = industry[~industry['industry'].isna()]

# Set industry_id
industry['industry_id'] = range(1, 1 + len(industry))

# industry table with alumni industry
industry

    industry_id                             industry
0             1                            Education
1             2                      Data/Technology
2             3            Business & Legal Services
3             4                           Healthcare
4             5                 Lifestyle & Consumer
5             6                 Finance & Investment
6             7                   Food & Agriculture
7             8                Research & Consulting
8             9                   Geospatial/Mapping
9            10                Environment & Weather
10           11                  Scientific Research
11           12                               Energy
12           13            Business & Legal Services
13           14                                Media
14           15                           Technology
15           16                 Software Development
16           17                       Transportation
17           18  Personal Care Product Manufacturing
18           19                            Musicians
19           20                    Finacial Services
20           21                           Governance
21           22                            Insurance
22           23                Aerospace and Defense
23           24                  Housing/Real Estate

In [59]:
# Join industry_id back to alumni1 table
alumni1 = alumni1.merge(industry, how='left', on=['industry'])

alumni1.head(10)
# Delete unnecessary column 'industry'
# del alumni_nf['industry']

,alumni_id,alumni_firstname,alumni_lastname,program_id,industry,alumni_phone_no_cell,alumni_phone_no_land,alumni_skill_1,alumni_skill_2,industry_id
0,nk7657,Neal,Kurt,15,Environment & Weather,905-951-5322,NaN,Scheduling,NaN,10.0
1,cr8605,Cunningham,Rosie,9,Media,750-933-3580,141-652-9789,Negotiation,NaN,14.0
2,le5799,Long,Elle,10,Research & Consulting,713-952-0376,NaN,Office Equipment,NaN,8.0
3,eo6439,Edwards,Oliver,7,Media,643-753-4622,NaN,Negotiation,NaN,14.0
4,pl5399,Price,Logan,13,Finance & Investment,294-879-8447,874-429-3715,Welcoming Visitors,Java,6.0
5,jr7218,Johnson,Rosalyn,10,Finance & Investment,765-767-4252,NaN,Lead Qualification,NaN,6.0
6,vh5628,Ventura,Harry,7,Governance,919-214-9720,911-105-5872,Negotiation,NaN,21.0
7,vt1529,Villiger,Teagan,9,Data/Technology,916-795-1144,533-746-4116,Communication,Machine Learning,2.0
8,hm7100,Harrington,Mary,11,Media,946-878-9892,NaN,Empathy,NaN,14.0
9,pe4593,Patel,Elise,8,Governance,240-849-6971,NaN,Accounting,NaN,21.0

In [60]:
# Create 3NF alumni table, remove the phone numbers
alumni_nf = alumni1[['alumni_id', 'alumni_firstname', 'alumni_lastname', 'program_id','industry_id']]

alumni_nf['industry_id'] = pd.to_numeric(alumni_nf['industry_id'].dropna()).astype(float).astype('Int64')

# Rename column names
alumni_nf.columns = ['alumni_id','alumni_first_name','alumni_last_name','program_id','industry_id']
#Final alumni table
alumni_nf.head(10)

  alumni_id alumni_first_name alumni_last_name  program_id  industry_id
0    nk7657              Neal             Kurt          15           10
1    cr8605        Cunningham            Rosie           9           14
2    le5799              Long             Elle          10            8
3    eo6439           Edwards           Oliver           7           14
4    pl5399             Price            Logan          13            6
5    jr7218           Johnson          Rosalyn          10            6
6    vh5628           Ventura            Harry           7           21
7    vt1529          Villiger           Teagan           9            2
8    hm7100        Harrington             Mary          11           14
9    pe4593             Patel            Elise           8           21

### Create 'student' table (step3)
##### Cancat student_id from Mentorship, names into student table

In [61]:
# Create temporary table for students from appointment
men_student = mentorship[['student_id','student_firstname','student_lastname']].drop_duplicates()
# Rename column names
men_student.columns=['student_id','student_first_name','student_last_name']

# Concat app_student with the industry table, and only concat the ones not in the table.
student = pd.concat([student, men_student[~np.in1d(men_student['student_id'], student['student_id'])]], 
                     ignore_index=True)

### Create 'mentorship' table

In [62]:
# Create mentorship database:
mentorship1 = mentorship[['student_id', 'alumni_id', 'mentorship_date']].drop_duplicates()
# Final memntorship Table
mentorship1.head(10)

  student_id alumni_id mentorship_date
0     hc3237    nk7657      2017-01-02
1     sl4152    cr8605      2016-11-29
2     gl4274    le5799      2019-04-22
3     bs7868    eo6439      2019-07-05
4     ga2856    pl5399      2017-04-27
5     cl2862    jr7218      2022-04-07
6     cs9514    vh5628      2016-05-29
7     tg5136    pl5399      2021-01-17
8     le6070    vt1529      2016-04-14
9     lf4312    hm7100      2016-04-22

## Skill

### Create 'skill' Table

In [63]:
# Create skill table:
# Extract unique alumni skills
alumni_skill=alumni['alumni_skill_1'].append(alumni['alumni_skill_2']).reset_index(drop=True).dropna().drop_duplicates()

# Extract unique student skills
student_skill=outcome['skill_1'].append(outcome['skill_2']).reset_index(drop=True).dropna().drop_duplicates()

# Combine the skill sets together and drop duplicates
skill = alumni_skill.append(student_skill).drop_duplicates()
skill = skill.reset_index(name='skill_name')
skill.insert(0, 'skill_id', range(1, 1 + len(skill)))
skill = skill[['skill_id', 'skill_name']]
skill.head(10)

/var/folders/dy/mgnhwqf52c16k3c_4v1r87pm0000gn/T/ipykernel_48488/355449301.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  alumni_skill=alumni['alumni_skill_1'].append(alumni['alumni_skill_2']).reset_index(drop=True).dropna().drop_duplicates()
/var/folders/dy/mgnhwqf52c16k3c_4v1r87pm0000gn/T/ipykernel_48488/355449301.py:6: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  student_skill=outcome['skill_1'].append(outcome['skill_2']).reset_index(drop=True).dropna().drop_duplicates()
/var/folders/dy/mgnhwqf52c16k3c_4v1r87pm0000gn/T/ipykernel_48488/355449301.py:9: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  skill = alumni_skill.append(student_skill).drop_duplicates()

   skill_id               skill_name
0         1               Scheduling
1         2              Negotiation
2         3         Office Equipment
3         4       Welcoming Visitors
4         5       Lead Qualification
5         6            Communication
6         7                  Empathy
7         8               Accounting
8         9  Customer Needs Analysis
9        10        Product Knowledge

### Create 'alumni_skill' Table

In [64]:
# Create alumni_skill table:
# Extract alumni_id and skills from alumni_info database
alumni_skill=alumni[['alumni_id', 'alumni_skill_1', 'alumni_skill_2']]

# Combine the two skill columns into one
alumni_skill['skills'] = alumni_skill[['alumni_skill_1', 'alumni_skill_2']].stack().groupby(level=0).agg(','.join)
askill=alumni_skill[['alumni_id', 'skills']]

# Split skills and expand row-wise. Store in a temporary dataframe
askill_df = askill.skills.str.split(',').apply(pd.Series, 1).stack()

# Drop index level to match main dataframe
askill_df.index = askill_df.index.droplevel(-1)

# Name of new column
askill_df.name = 'skill_name'

# Only keep the alumni_id of the alumni_skill table
alumni_skill_df=alumni_skill[['alumni_id']]

# Join the original dataframe with the temporary skills
alumni_skill_df = alumni_skill_df.join(askill_df)

# Match skill_id with skill_name
alumni_skill_df = pd.merge(alumni_skill_df, skill, how='left', left_on='skill_name', right_on='skill_name')
alumni_skill_df = alumni_skill_df[['alumni_id', 'skill_id']].drop_duplicates()
alumni_skill_df.head(10)

  alumni_id  skill_id
0    nk7657         1
1    cr8605         2
2    le5799         3
3    eo6439         2
4    pl5399         4
5    pl5399        28
6    jr7218         5
7    vh5628         2
8    vt1529         6
9    vt1529        29

### Create 'student_skill' Table

In [65]:
# Create student_skill table:
# Extract student_id and skills from student career outcome database
student_skill=outcome[['student_id', 'skill_1', 'skill_2']]

# Combine the two skill colmuns into one
student_skill['skills'] = student_skill[['skill_1', 'skill_2']].stack().groupby(level=0).agg(','.join)
sskill=student_skill[['student_id', 'skills']]

# Split skills and expand row-wise. Store in a temporary dataframe
sskill_df = sskill.skills.str.split(',').apply(pd.Series, 1).stack()

# Drop index level to match main dataframe
sskill_df.index = sskill_df.index.droplevel(-1)

# Name of new column
sskill_df.name = 'skill_name'

# Only keep the alumni_id of the alumni_skill table
student_skill_df=student_skill[['student_id']]

# Join the original dataframe with the temporary skills
student_skill_df = student_skill_df.join(sskill_df)

# Match skill_id with skill_name
student_skill_df = pd.merge(student_skill_df, skill, how='left', left_on='skill_name', right_on='skill_name')
student_skill_df = student_skill_df[['student_id', 'skill_id']].drop_duplicates()
student_skill_df.head(10)

  student_id  skill_id
0     tw3253        10
1     ae4257        22
2     pg3091         1
3     rt6370        14
4     aj7909        16
5     ct7496        22
6     kb5221        32
7     th7206        24
8     mk8948        21
9     jm9051         7

## Phone

In [66]:
outcome.head()

,student_id,last_name,first_name,city,state,country,program,graduation term,graduation year,phone_no_cell,phone_no_land,skill_1,skill_2,work_city,work_country,job_type,industry_id
0,tw3253,Woolerton,Tessy,Minneapolis,Minnesota,United States,Sustainability Science,Summer,2021,600-639-5191,321-969-8472,Product Knowledge,NaN,Auburn Hills - MI,United States (USA),Postponing job search,2
1,ae4257,Edgcombe,Adriaens,Boise,Idaho,United States,Nonprofit Management,Fall,2021,754-790-0611,NaN,Creativity,NaN,Chennai - India,India,Still Seeking Employment,11
2,pg3091,Girardi,Phaedra,Scranton,Pennsylvania,United States,Nonprofit Management,Spring,2016,332-195-5165,NaN,Scheduling,NaN,Old Westbury - NY,United States (USA),Military Service,21
3,rt6370,Tolputt,Ruperto,Newport Beach,California,United States,Narrative Medicine,Summer,2016,482-623-1659,297-942-0505,Organization,NaN,San Mateo - CA,United States (USA),Internship,4
4,aj7909,Jansey,Aridatha,Decatur,Georgia,United States,Sustainability Science,Spring,2022,828-523-0350,764-272-3322,Contract Negotiation,NaN,Philadelphia - PA,United States (USA),Not seeking an internship,2

### Create 'student_phone' Table

In [67]:
#get student_id phone_num and phone_type = cell from student dataset
student_phone_cell = outcome.loc[:, ['student_id', 'phone_no_cell']]
student_phone_cell['Type'] = np.where(student_phone_cell['phone_no_cell'].isnull(), 0, 'cell')
student_phone_cell.columns = ['student_id','phone_num','phone_type']

#get student_id phone_num and phone_type = land from student dataset
student_phone_land = outcome.loc[:, ['student_id', 'phone_no_land']]
student_phone_land['Type'] = np.where(student_phone_land['phone_no_land'].isnull(), 0, 'land')
student_phone_land.columns = ['student_id','phone_num','phone_type']
#drop student_phone_cell na value
student_phone_cell.dropna(inplace=True)

#drop student_phone_land na value
student_phone_land.dropna(inplace=True)

#combine these two dataframes into df
student_phone = pd.concat([student_phone_land, student_phone_cell]).drop_duplicates()

# insert student_phone_id
student_phone.insert(0, 'student_phone_id', range(1, 1 + len(student_phone)))

# reorder the columns
student_phone = student_phone[['student_phone_id','phone_num','phone_type','student_id']]

student_phone.head()

   student_phone_id     phone_num phone_type student_id
0                 1  321-969-8472       land     tw3253
3                 2  297-942-0505       land     rt6370
4                 3  764-272-3322       land     aj7909
7                 4  157-166-8274       land     th7206
8                 5  285-727-2537       land     mk8948

### Create 'alumni_phone' Table

In [68]:
#get alumni_id phone_num and phone_type = cell from alumni dataset
alumni_phone_cell = alumni1.loc[:, ['alumni_id', 'alumni_phone_no_cell']]
alumni_phone_cell['Type'] = np.where(alumni_phone_cell['alumni_phone_no_cell'].isnull(), 0, 'cell')
alumni_phone_cell.columns = ['alumni_id','phone_num','phone_type']

#get alumni_id phone_num and phone_type = land from alumni dataset
alumni_phone_land = alumni1.loc[:, ['alumni_id', 'alumni_phone_no_land']]
alumni_phone_land['Type'] = np.where(alumni_phone_land['alumni_phone_no_land'].isnull(), 0, 'land')
alumni_phone_land.columns = ['alumni_id','phone_num','phone_type']

#drop NA value in alumni_phone_cell
alumni_phone_cell.dropna(inplace=True)

#drop NA value in alumni_phone_land
alumni_phone_land.dropna(inplace=True)

#combine cell and land dataframe into df1
alumni_phone = pd.concat([alumni_phone_land, alumni_phone_cell]).drop_duplicates()

# insert alumni_phone_id
alumni_phone.insert(0, 'alumni_phone_id', range(1, 1 + len(alumni_phone)))

# reorder the columns
alumni_phone = alumni_phone[['alumni_phone_id','phone_num','phone_type','alumni_id']]

alumni_phone.head()

    alumni_phone_id     phone_num phone_type alumni_id
1                 1  141-652-9789       land    cr8605
4                 2  874-429-3715       land    pl5399
6                 3  911-105-5872       land    vh5628
7                 4  533-746-4116       land    vt1529
16                5  669-649-7674       land    sn9731

### Create 'advisor_phone' Table

In [69]:
#get advisor_id phone_num and phone_type = cell from advisor dataset
advisor_phone_cell = advisor1.loc[:, ['adv_id', 'adv_phone_no_cell']]
advisor_phone_cell['Type'] = np.where(advisor_phone_cell['adv_phone_no_cell'].isnull(), 0, 'cell')
advisor_phone_cell.columns = ['advisor_id','phone_num','phone_type']

#get advisor_id phone_num and phone_type = land from advisor dataset
advisor_phone_land = advisor1.loc[:, ['adv_id', 'adv_phone_no_land']]
advisor_phone_land['Type'] = np.where(advisor_phone_land['adv_phone_no_land'].isnull(), 0, 'land')
advisor_phone_land.columns = ['advisor_id','phone_num','phone_type']

# Drop NA value in cell dataframe
advisor_phone_cell.dropna(inplace=True)

# Drop NA value in land dataframe
advisor_phone_land.dropna(inplace=True)

# combine land and cell dataframe into df2
advisor_phone = pd.concat([advisor_phone_land, advisor_phone_cell]).drop_duplicates()

# insert alumni_phone_id
advisor_phone.insert(0, 'advisor_phone_id', range(1, 1 + len(advisor_phone)))

# reorder the columns
advisor_phone = advisor_phone[['advisor_phone_id','phone_num','phone_type','advisor_id']]

advisor_phone.head()

    advisor_phone_id     phone_num phone_type advisor_id
1                  1  507-874-5721       land     jr5803
3                  2  189-630-4794       land     cj1862
4                  3  808-199-8505       land     ly7056
7                  4  842-248-2113       land     md1305
15                 5  752-872-1547       land     eg1362

# Loading into database tables

In [70]:
program.columns = ['program_id', 'program_name']
program.to_sql(name='program', con=engine, if_exists='append', index=False)

17

In [71]:
industry.columns = ['industry_id','industry_name']
industry.to_sql(name='industry', con=engine, if_exists='append', index=False)

24

In [72]:
student.to_sql(name='student', con=engine, if_exists='append', index=False)

1000

In [73]:
advisor_nf.to_sql(name='advisor', con=engine, if_exists='append', index=False)

48

In [74]:
appointment1.to_sql(name='appointment', con=engine, if_exists='append', index=False)

200

In [75]:
alumni_nf.to_sql(name='alumni', con=engine, if_exists='append', index=False)

50

In [76]:
mentorship1.to_sql(name='mentorship', con=engine, if_exists='append', index=False)

499

In [77]:
skill.to_sql(name='skill', con=engine, if_exists='append', index=False)

60

In [78]:
student_skill_df.to_sql(name='student_skill', con=engine, if_exists='append', index=False)

779

In [79]:
alumni_skill_df.to_sql(name='alumni_skill', con=engine, if_exists='append', index=False)

54

In [80]:
student_phone.to_sql(name='student_phone', con=engine, if_exists='append', index=False)

103

In [81]:
alumni_phone.to_sql(name='alumni_phone', con=engine, if_exists='append', index=False)

70

In [82]:
advisor_phone.to_sql(name='advisor_phone', con=engine, if_exists='append', index=False)

67

In [83]:
career_event.to_sql(name='career_event', con=engine, if_exists='append', index=False)

331

In [84]:
registration.to_sql(name='registration', con=engine, if_exists='append', index=False)

204

In [85]:
career_outcome.to_sql(name='career_outcome', con=engine, if_exists='append', index=False)

300

In [86]:
temp_employer_df.to_sql(name='company', con=engine, if_exists='append', index=False)

20

In [87]:
job_list_df.to_sql(name='job_list', con=engine, if_exists='append', index=False)

61

In [88]:
Subject.to_sql(name='subject', con=engine, if_exists='append', index=False)

31

In [89]:
online_course.to_sql(name='online_course', con=engine, if_exists='append', index=False)

975

In [90]:
instructors.to_sql(name='instructor', con=engine, if_exists='append', index=False)

562

In [91]:
course_teaching.to_sql(name='course_teaching', con=engine, if_exists='append', index=False)

105

In [92]:
news.to_sql(name='news', con=engine, if_exists='append', index=False)

872

### Spot Checks & Validation

In [93]:
stmt1 = """

SELECT * FROM program;

"""
# Execute the statement and get the results
results1 = connection.execute(stmt1).fetchall()

# Extract column names
column_names1 = results1[0].keys()

# Store results in a new dataframe
temp_df1 = pd.DataFrame(results1, columns=column_names1)

# Show results
print(temp_df1)

    program_id                         program_name
0            1               Sustainability Science
1            2                 Nonprofit Management
2            3                   Narrative Medicine
3            4              Strategic Communication
4            5  Negotiation and Conflict Resolution
5            6                    Wealth Management
6            7                    Sports Management
7            8          Construction Administration
8            9             Human Capital Management
9           10            Sustainability Management
10          11           Enterprise Risk Management
11          12                    Actuarial Science
12          13                    Applied Analytics
13          14                            Bioethics
14          15       Information Knowledge Strategy
15          16                Technology Management
16          17                 Insurance Management